cask_args appdir: '/Applications'
tap 'shopify/shopify'
tap 'graalvm/homebrew-tap'

# essentials
cask 'adoptopenjdk8'
cask 'iterm2'
brew 'git'
brew 'bash'
brew 'bash-completion'
brew 'bash-git-prompt'
cask 'google-backup-and-sync'
cask 'keybase'
brew 'gpg'
brew 'jq'
brew 'yq'
brew 'direnv'
brew 'pup'
brew 'httpie'
brew 'streamlink'
cask 'firefox'
cask 'spotify'
cask 'private-internet-access'
cask 'mpv'
brew 'syncthing'
brew 'curl'
brew 'nghttp2'

# languages
# cask 'java'
# cask 'adoptopenjdk8'
# https://github.com/graalvm/homebrew-tap
cask 'graalvm-ce-java11'
cask 'graalvm-ce-java8'
brew 'scala'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'golang'
brew 'gpm' # go package manager
brew 'nvm'
brew 'lua'
brew 'rust'
brew 'perl'
brew 'ruby'
brew 'rbenv'
brew 'idris'
brew 'dhall-json'

# development tools
cask 'visual-studio-code'
cask 'intellij-idea-ce'
cask 'sublime-text'
cask 'docker'
mas 'Xcode', id: 497799835
brew 'vim'
brew 'macvim'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'helmfile'
brew 'vault'
brew 'kubectx'
brew 'aws-iam-authenticator'
brew 'terraform'

# build tools
brew 'sbt'
brew 'maven'
brew 'gradle'
brew 'leiningen'
brew 'bazel'

# language extras
brew 'giter8'
brew 'zinc'
brew 'nailgun'
brew 'ammonite-repl'
brew 'avro-tools'

# utilities
cask 'dropbox'
cask 'diffmerge'
brew 'wrk'
brew 'asciinema'
brew 'youtube-dl'
brew 'ossp-uuid'
brew 'toxiproxy'

# etc
brew 'telnet'
brew 'hopenpgp-tools'
brew 'ykman'
brew 'pinentry-mac'
mas '1password-password-manager-and-secure-wallet', id: 443987910
mas 'status-clock', id: 552792489
mas 'slack', id: 803453959
cask 'gitter'
mas 'divvy-window-manager', id: 413857545
brew 'yubikey-personalization'
mas 'yubikey-personalization-tool', id: 638161122
mas 'amphetamine', id: 937984704
mas 'noteability', id: 736189492

brew 'msgpack'
brew 'ack'
brew 'ripgrep'
brew 'autoconf'
brew 'make'
brew 'automake'
brew 'awscli'
brew 'boost'
brew 'cairo'
brew 'coreutils'
brew 'findutils'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnutls'
brew 'isl'
brew 'jmeter'
brew 'json-c'
brew 'libestr'
brew 'libffi'
brew 'libmpc'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libyaml'
brew 'llvm'
brew 'mpfr'
brew 'nmap'
brew 'openldap'
brew 'openssl'
brew 'p7zip'
brew 'packer'
brew 'parallel'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'pv'
brew 'pwgen'
brew 'readline'
brew 'rename'
brew 'sdl'
brew 'sdl2'
brew 'snappy'
brew 'sqlite'
brew 'terminal-notifier'
brew 'texinfo'
brew 'thrift'
brew 'tig'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yasm'
brew 'zlib'

# Services
brew 'mysql'
brew 'postgresql'

# Other
brew 'certbot'
brew 'ddrescue'
brew 'fdk-aac'
brew 'fribidi'
brew 'opencv'
brew 'lame'
brew 'libevent'
brew 'libvorbis'
brew 'libvpx'
brew 'opus'
brew 'socat'
brew 'tesseract'
brew 'texi2html'
brew 'x265'
brew 'xmlstarlet'

cask 'xquartz'
