cask_args appdir: '/Applications'
tap 'caskroom/cask'

# essentials
brew 'git'
brew 'bash'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'jq'
cask 'private-internet-access'

# languages
cask 'java'
brew 'scala@2.11'
brew 'python'
brew 'python3'
brew 'golang'
brew 'node'
brew 'lua'
brew 'rust'

# development tools
cask 'intellij-idea-ce'
cask 'sublime-text'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
mas 'Xcode', id: 497799835
brew 'macvim'
brew 'heroku-toolbelt'

# build tools
brew 'sbt'
brew 'maven'
brew 'gradle'
brew 'leiningen'
brew 'bazel'

# language extras
brew 'giter8'
brew 'zinc'
brew 'nailgun'
cask 'ammonite'
brew 'ammonite-repl'
brew 'apache-spark'
brew 'avro-tools'

# utilities
cask 'iterm2'
cask 'dropbox'
cask 'vagrant'
cask 'virtualbox'
cask 'diffmerge'
cask 'screenhero'

# etc
mas '1password-password-manager-and-secure-wallet', id: 443987910
mas 'status-clock', id: 552792489
mas 'slack', id: 803453959
mas 'divvy-window-manager', id: 413857545
mas 'yubikey-personalization-tool', id: 638161122
mas 'amphetamine', id: 937984704

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'boost'
brew 'cairo'
brew 'coreutils'
brew 'findutils'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'gcc'
brew 'gdbm'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnutls'
brew 'isl'
brew 'jmeter'
brew 'json-c'
brew 'libestr'
brew 'libffi'
brew 'libmpc'
brew 'libpng'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libyaml'
brew 'llvm'
brew 'mpfr'
brew 'nmap'
brew 'openldap'
brew 'openssl'
brew 'p7zip'
brew 'packer'
brew 'parallel'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'pv'
brew 'pwgen'
brew 'readline'
brew 'rename'
brew 'sdl'
brew 'sdl2'
brew 'snappy'
brew 'sqlite'
brew 'terminal-notifier'
brew 'texinfo'
brew 'thrift'
brew 'tig'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'yasm'

# ARM build tools
brew 'crosstool-ng'
brew 'gettext'

# Services
brew 'mysql'
brew 'redis@2.8'
